{
  "WorkExperience": [
    {
      "CompanyName": "Cegedim Egypt",
      "From": "9/2021",
      "To": "Present",
      "StillThere": false,
      "AboutCompany": "Cegedim offers innovative solutions and services based on a high-quality service infrastructure capable of supporting the needs of its customers.",
      "ProjectsList": [
        {
          "ProjectName": "Vision",
          "Logo": "",
          "Tasks": [
            "Leading the frontend side of the patient facing manager (PSM) service for the vision project.",
            "Developing new product features for PSM and applying knowledge of ReactJS, Redux and NextJs as a result 10 releases have been deployed just-in-time.",
            "Responsible for code reviews made from the frontend side.",
            "Creating and managing deployment scripts for node related components using Skaffold, Docker and Kubernetes.",
            "Improving product aesthetic and UX of the patient service manager web application, resulting in CHI (Customers Happiness Index) increase.",
            "Resolved technical problems relating to the patient service manager portal, resulting in system performance and scalability improvements."
          ]
        }
      ]
    },
    {
      "CompanyName": "Qestit EG (Qcentris EG)",
      "From": "11/2017",
      "To": "9/2021",
      "StillThere": false,
      "AboutCompany": "Established in 2011, Qestit (Qcentris before) have grown into an international company renowned for our in-depth expertise in enabling digital transformation success. As a leading company focusing on software development, quality assurance, consulting and outsourcing, we serve a wide spectrum of industries",
      "ProjectsList": [
        {
          "ProjectName": "Banque Misr Digital Transformation Office",
          "Logo": "",
          "Tasks": [
            "Developing product features for new SME Loaning and corporate onboarding platforms with applying knowledge of Angular, as a result we successfully launched 2 of the biggest banking platforms in the country",
            "Resolved technical problems relating to the SME Loaning and corporate onboarding portals, resulting in system performance and scalability improvements.",
            "Participated in code reviews related to the frontend sides of the projects.",
            "Participated in developing and writing deployment scripts related to the frontend side of the projects using Skaffold, Docker and Kubernetes.",
            "Was one of the very first starting developers for the digital transformation office of bank misr and successfully delivered 2 highly scaled products that they are still serving 100 thousands of users to this day."
          ]
        },
        {
          "ProjectName": "Additiv AG",
          "Logo": "",
          "Tasks": [
            "Developing product features for new Robo advisor sytem with applying knowledge of ReactJS (class components) as a result we successfully did multiple release cycles.",
            "Resolved technical problems relating to the components managment in react resulting in system performance and scalability improvement.",
            "Participated in code reviews related to the frontend sides of the projects.",
            "Created and performed automated tests using cypress as an early adapter."
          ]
        }
      ],
      "ReferencesList": [
        {
          "name": "Shady El Kady",
          "position": "Project Tech Lead",
          "email": "Elkady.shady@gmail.com"
        },
        {
          "name": "Mohamed Awad",
          "position": "Project Tech Lead",
          "email": "mawad.eg93@gmail.com"
        },
        {
          "name": "Ahmed El Mahdy",
          "position": "Head of Qcentris Egypt office",
          "email": "a.abdeltawab@qestit.com"
        }
      ]
    },
    {
      "CompanyName": "Go Studios Kuwait",
      "From": "4/2021",
      "To": "6/2021",
      "StillThere": false,
      "AboutCompany": "Go Studios is a small start up focusing on creating e-Commerce management apps",
      "ProjectsList": [
        {
          "ProjectName": "Go Watches App",
          "Logo": "",
          "Tasks": [
            "(Part time) Managing the workflow and development of multiple react components and leading the project's FE team"
          ]
        }
      ]
    }
  ]
}